Repository: billKaunda/doublequotes
Catalog: packages/features/activity_list/lib/src/l10n/messages_*.arb
Languages: sw

# activityListRefreshErrorMessage
source: We couldn't refresh your items. Please check your internet and then try again.
sw: Hatukuweza kuonyesha upya vipengee vyako. Tafadhali angalia muunganisho wako wa mtandao kisha ujaribu tena.

# authorChoiceChipLabel
source: Author
sw: Mwandishi

# tagChoiceChipLabel
source: Tag
sw: Tagi

# userChoiceChipLabel
source: User
sw: Mtumiaji

# followersChoiceChipLabel
source: Followers
sw: Wafuasi

# noActivityBodyErrorMessage
source: No Activity Body Found
sw: Hakuna Mwili wa Shughuli uliopatikana

# firstPageFetchErrorMessageTitle
source: First Page Fetch Error
sw: Hitilafu ya Kuleta Ukurasa wa Kwanza

# firstPageFetchErrorMessageBody
source: Error loading the first page. Please, tap Try Again
sw: Hitilafu katika kupakia ukurasa wa kwanza. Tafadhali, jaribu tena.

# activityOwnerTypeMissing
source: OwnerType Is Missing
sw: Aina ya Mmiliki Haipo

# activityOwnerNotFound
source: OwnerValue Not Found
sw: Thamani ya Mmiliki Haijapatikana

# activityActionNotFound
source: No action found on this activity
sw: Hakuna kitendo kilichopatikana kwenye shughuli hii

# activityTrackableTypeMissing
source: TrackableType Missing
sw: Aina Inayofuatiliwa Haipo

source: TrackableValue Not Found
sw: Thamani Inayoweza Kufuatiliwa Haijapatikana

# activityMessageBodyNotFound
source: Message Body Empty
sw: Mwili wa Ujumbe Utupu

# customAlertDialogTitle
source: Delete Activity
sw: Futa Shughuli

# customAlertDialogContent
source: Are you sure you want to delete this {trackableType} activity {action} by {ownerValue}
sw: Je, una uhakika unataka kufuta shughuli hii ya {trackableType} ya {ownerValue}

# cancelButtonLabel
source: Cancel
sw: Ghairi

# deleteButtonLabel
source: Delete
sw: Futa
