Repository: billKaunda/doublequotes
Catalog: packages/features/profile_menu/lib/src/l10n/messages_*.arb
Languages: sw

# signInButtonLabel
source: Sign In
sw: Weka Sahihi

# signInUserGreeting
source: Hi {username}
sw: Hujambo {username}

# updateProfileTileLabel
source: Update Profile
sw: Sasisha Wasifu

# signOutButtonLabel
source: Sign Out
sw: Toka

# signUpOpeningText
source: Don't have an account?
sw: Je, huna akaunti?

# signUpButtonLabel
source: Sign Up
sw: Jisajili

# usernameLabel
source: Username
sw: Jina la mtumiaji

# usernameTextFieldEmptyErrorMessage
source: Your username can't be empty.
sw: Jina lako la mtumiaji haliwezi kuwa tupu.

# usernameTextFieldAlreadyTakenErrorMessage
source: This username is already taken.
sw: Jina hili la mtumiaji lipo. Chagua nyingine.

# usernameTextFieldInvalidErrorMessage
source: Your username must be 1-20 characters long and can only contain letters, numbers, and the underscore (_).
sw: Jina lako la mtumiaji lazima liwe na urefu wa vibambo 1-20, na linaweza tu kuwa na herufi, nambari, na alama ya kusisitiza(_).

# emailLabel
source: Email
sw: Barua Pepe

# emailTextFieldEmptyErrorMessage
source: Your email can't be empty.
sw: Barua pepe yako haiwezi kuwa tupu.

# emailTextFieldAlreadyRegisteredErrorMessage
source: This email is already registered.
sw: Barua pepe hii tayari imesajiliwa nasi.

# emailTextFieldInvalidErrorMessage
source: This email is not valid.
sw: Barua pepe hii si sahihi.

# updatePasswordTileLabel
source: Update Password
sw: Sasisha Nenosiri

# passwordLabel
source: New Password
sw: Nenosiri mpya

# passwordTextFieldInvalidErrorMessage
source: Password must be at least five characters long.
sw: Nenosiri lazima liwe na urefu wa angalau vibambo 5.

# passwordConfirmationLabel
source: New Password Confirmation
sw: Uthibitishaji wa Nenosiri Mpya.

# passwordConfirmationTextFieldInvalidErrorMessage
source: Your passwords don't match.
sw: Manenosiri yako hayalingani.

# xUsernameLabel
source: X Username
sw: Jina la mtumiaji katika X

# xUsernameTextFieldEmptyErrorMessage
source: Your X username can't be empty.
sw: Jina lako la mtumiaji la X haliwezi kuwa tupu.

# xUsernameTextFieldInvalidErrorMessage
source: Your X username must be 4-15 characters long and can only contain letters, numbers, underscore (_) and the (@) symbol.
sw: Jina lako la mtumiaji la X lazima liwe na urefu wa vibambo 4-15, na linaweza tu kuwa na herufi, nambari, alama ya kusisitiza(_), na (@).

# facebookUsernameLabel
source: Facebook Username
sw: Jina la mtumiaji katika facebook

# facebookUsernameTextFieldEmptyErrorMessage
source: Your facebook username can't be empty.
sw: Jina lako la mtumiaji haliwezi kuwa tupu.

# facebookUsernameTextFieldInvalidErrorMessage
source: Your facebook username must be 4-15 characters long and can only contain letters, numbers, underscore (_) and the (@) symbol.
sw: Jina lako la mtumiaji lazima liwe na urefu wa vibambo 4-15, na linaweza tu kuwa na herufi, nambari, alama ya kusisitiza(_), na (@).

# profanityFilterTileLabel
source: Profanity Filter
sw: Kichujio cha Matusi

# enableProfanityFilterSubtitle
source: Allow profane quotes to be displayed
sw: Ruhusu nukuu za lugha chafu zionyeshwe

# disableProfanityFilterSubtitle
source: Disable profane quotes from being displayed
sw: Lemaza dondoo za lugha chafu zisionyeshwe

# updateProfileButtonLabel
source: Update Profile
sw: Sasisha Wasifu

# followersLabel
source: Followers
sw: Wafuasi

# followingLabel
source: Following
sw: Wanaokufuata

# publicFavoritesLabel
source: Public Favorites
sw: Nukuu Vipendwa vya Umma

# setPicFromFacebookSubtitle
source: Set profile picture from Facebook
sw: Weka picha ya wasifu kutoka Facebook

# emptyFacebookUsernameErrorMessage
source: Oops, you haven't set your facebook username yet. Please update it then try again
sw: Lo, bado hujaweka jina lako la mtumiaji la facebook. Tafadhali isasishe kisha ujaribu tena

# setPicFromXSubtitle
source: Set profile picture from X
sw: Weka picha ya wasifu kutoka kwa X

# emptyXUsernameErrorMessage
source: Oops, you haven't set your X username yet. Please update it then try again
sw: Lo, bado hujaweka jina lako la mtumiaji la X. Tafadhali isasishe kisha ujaribu tena

# setPicFromEmailSubtitle
source: Set profile picture from Email Gravater
sw: Weka picha ya wasifu kutoka Email Gravater

# emptyEmailGravaterErrorMessage
source: Oops, you haven't set Email Gravater yet. Please update it then try again
sw: Lo, bado hujaweka jina lako la mtumiaji la Email Gravater. Tafadhali isasishe kisha ujaribu tena
