Repository: billKaunda/doublequotes
Catalog: packages/features/sign_up/lib/src/l10n/messages_*.arb
Languages: sw

# invalidCredentialsErrorMessage
source: Invalid email and/or password.
sw: Barua pepe na/au nenosiri si sahihi

# appBarTitle
source: Sign Up
sw: Jiandikishe

# signUpButtonLabel
source: Sign Up
sw: Jisandikishe

# usernameTextFieldLabel
source: Username
sw: Jina la mtumiaji

# usernameTextFieldEmptyErrorMessage
source: Your username can't be empty
sw: Jina lako la mtumiaji haliwezi kuwa tupu

# usernameTextFieldInvalidErrorMessage
source: Username can only be 1-20 characters long, and can contain letters, numbers, and the underscore only.
sw: Jina la mtumiaji linaweza kuwa na urefu wa vibambo 1-20 pekee, na linaweza kuwa na herufi, nambari, na alama ya chini pekee.

# usernameTextFieldAlreadyTakenErrorMessage
source: This username is already taken.
sw: Jina hili la mtumiaji tayari limechukuliwa.

# emailTextFieldLabel
source: Email
sw: Barua Pepe

# emailTextFieldEmptyErrorMessage
source: Your email can't be empty.
sw: Barua pepe yako haiwezi kuwa tupu.

# emailTextFieldInvalidErrorMessage
source: This email address is not valid.
sw: Barua pepe hii si sahihi.

# emailTextFieldAlreadyRegisteredErrorMessage
source: Sorry, this email is already registered with us.
sw: Samahani, barua pepe hii tayari imesajiliwa nasi.

# passwordTextFieldLabel
source: Password
sw: Nenosiri

# passwordTextFieldEmptyErrorMessage
source: Your password can't be empty.
sw: Nenosiri lako haliwezi kuwa tupu.

# passwordTextFieldInvalidErrorMessage
source: Password must be at least 5 characters long.
sw: Nenosiri lazima liwe na urefu wa angalau vibambo 5.

# passwordConfirmationTextFieldLabel
source: Password Confirmation
sw: Uthibitishaji wa Nenosiri

# passwordConfirmationTextFieldEmptyErrorMessage
source: This field can't be emtpy.
sw: Sehemu hii haiwezi kuwa tupu.

# passwordConfirmationTextFieldInvalidErrorMessage
source: Your password don't match.
sw: Nenosiri lako halilingani.
