Repository: billKaunda/doublequotes
Catalog: packages/features/quote_details/lib/src/l10n/messages_*.arb
Languages: sw

# quoteNotFoundErrorMessageTitle
source: Quote Not Found
sw: Nukuu Haijapatikana

# quoteNotFoundErrorMessageBody
source: Ooopss, the requested quote cannot be retrieved, please try again.
sw: Samahani, nukuu uliyoomba haiwezi kurejeshwa. Tafadhali, jaribu tena.

# addQuoteMenuItemButtonLabel
source: Add Quote
sw: Ongeza nukuu

# addTagToQuoteMenuItemButtonLabel
source: Add tag to quote
sw: Ongeza lebo kwa nukuu

# makeQuotePublicMenuItemButtonLabel
source: Make quote public
sw: Weka nukuu hadharani

# makeQuotePrivateMenuItemButtonLabel
source: Make quote private
sw: Fanya nukuu iwe ya faragha

# cannotUnfavPrivateQuoteErrorMessage
source: Private quotes cannot be unfav'd
sw: Nukuu za kibinafsi haziwezi kutenduliwa

# userSessionNotFoundErrorMessage
source: Please sign in to continue
sw: Tafadhali jisajili ili endelee

# proUserRequiredErrorMessage
source: Upgrade to Pro
sw: Pata toleo jipya la Pro

# couldNotCreateQuoteErrorMessage
source: Ooopss, could not create quote
sw: Samahani, hatukuweza kuunda nukuu

# unknownAuthorPlaceholder
source: Unknown author
sw: Mwandishi hajulikani

# noContentAvailablePlaceholder
source: No content available
sw: Hakuna maudhui yanayopatikana
